Repository: sugarlabs/read-sd-comics
Catalog: po/hus.po
Languages: hus

source: Read SD Comics
hus: ka ajiy an dhulkuts ma ti jun i SD

source: Back
hus: Kux

source: Previous page
hus: wat'enekits wal xeklek

source: Forward
hus: ok'ox

source: Next page
hus: JÃºnakej walxeklek

source: Zoom out
hus: tsiptimedha

source: Zoom in
hus: Puwedha

source: Fullscreen
hus: Putat walek

source: Read Comic
hus: Ajiy dhulkuts

source: Read
hus: ajiy

source: View
hus: Tsu'uw
